/*  1  Заредете картинка (по ваш избор) на екрана от лявата страна, вертикално центрирана. Картинката трябва да започне да се 
 движи надясно докато стигне другия край на прозореца. Когата дясната част на картинката стигне до края на прозореца, 
 картинката си сменя посоката и тръгва наляво. Като стигне до първоначалното си местоположение всичко се повтаря. 
 (БОНУС ТОЧКИ: скоростта на движение се увеличава докато върви програмата) ;
 2   В клас Shapes добавете нова статична функция drawPentagon, която рисува правилен петоъгълник по координати на 
 централната точка и дължина на страната в пиксели;
 3   В клас Shapes добавете нова статична функция drawHexagon, която рисува правилен шестоъгълник по координати на
  централната точка и дължина на страната в пиксели;
 4   (БОНУС ЗАДАЧА) В клас Shapes добавете нова статична функция, която рисува фигура по ваше желание (различна от 
 правоъгълник, окръжност, петоъгълник, шестоъгълник);
 5   Разделете прозореца на 4 части като нарисувате 2 лении през средите на на страните (представете си логото на windows). 
 Като кликнете с мишката в някоя от частите да зарежда картинка в часта в която сте кликнали. Всяка от 4те части да зарежда 
 различна картинка. (БОНУС ТОЧКИ: като кликнете отново на картинката, се скрива);
 6   Напишете функция която рисува празен правоъгълник с подадена дебелина на линиите. (ПОЯСНЕНИЕ: може да стане с помощта 2 
 запълнени правоъгълника);
 7   Нарисувайте картинка в средата на прозореца. Със стрелките на клавиатурате местете картинката в прозореца (БОНУС ТОЧКИ:
  ако кликнете в прозореца с мишката, центъра на картинката отива на кликнатото място);
 8   Харесайте си sprite sheetс няколко реда и анимирайте последователно редовете;
 9   *(БОНУС ЗАДАЧА)*Нарисувайте фигура в прозореца. Цвета на фигурата се сменя в зависимост от позицията на мишката в 
 прозореца (ПОДСКАЗКА: може да вържете координатие на мишката с RGB стойностите на фигурата);
 10   (БОНУС БОНУС ЗАДАЧА) В клас Shapes добавете нова статична функция drawEllipse, която рисува елипса;


Сваляте и инсталирате CMake. Разархивирате репото в папка по избор. Отваряте файла CMakeLists.txt и 
четете внимателно коментарите. При променливите set(...) си слагате пътя до вашите папки. Останалите 
команди са готови да работят с файловете от репото.

Build без Visual Studio: В папката със source файловете отваряте терминал/конзола/powershell. Пишете 
командата cmake -B out/build -S . Ако горната команда е успешна пишете cmake --build out/build

out/build в първата команда създава директория out в която слага директория build в която ще се 
build-ва проекта. out/build във втората команда посочва директорията в която да се build-не. Ако
 всичко мине успешно, в out/build/Debug трябва да имате .exe файл, .dll файлове и assets папка. 
 Ако пуснете .exe файла ще се пуснете програмата.

Build с Visual Studio: Папката със source файловете я отваряте с Visual Studio. Изчаквате Visual
 Studio да се усети какво се случва. От dropdown-a на зелената стрелка (с която обикновено run-вате 
 проектите) избирате .exe файла и след това го run-вате. Ако всичко мине успешно, в out/build/Debug 
 трябва да имате .exe файл, .dll файлове и assets папка. Ако пуснете .exe файла ще се пуснете програмата. */